@jacobbednarz I think we should reopen the issue. Please find all info below
terraform configuration:
```
resource "aws_api_gateway_domain_name" "api-gw-domain-name" {
  domain_name              = "anton-test"
  regional_certificate_arn = "CERT_ARN"
  security_policy          = "TLS_1_2"

  endpoint_configuration {
    types = ["REGIONAL"]
  }
}

resource "cloudflare_record" "api-custom-domain-auth-service" {
  zone_id    = "ZONE_ID"
  name       = "test"
  value      = aws_api_gateway_domain_name.api-gw-domain-name.cloudfront_domain_name
  type       = "CNAME"
  ttl        = 300
}
```
versions.tf:
```
terraform {
  required_providers {
    aws = {
      source  = "hashicorp/aws"
      version = "~> 3.20.0"
    }
    cloudflare = {
      source  = "cloudflare/cloudflare"
      version = "~> 2.17.0"
      # make sure you have CLOUDFLARE_API_TOKEN environment variable defined
    }
    null = {
      source = "hashicorp/null"
    }
  }
  required_version = ">= 0.14"
}
```
output:
```
 # aws_api_gateway_domain_name.api-gw-domain-name will be created
  + resource "aws_api_gateway_domain_name" "api-gw-domain-name" {
      + arn                      = (known after apply)
      + certificate_upload_date  = (known after apply)
      + cloudfront_domain_name   = (known after apply)
      + cloudfront_zone_id       = (known after apply)
      + domain_name              = "anton-test.katapult.com"
      + id                       = (known after apply)
      + regional_certificate_arn = "arn:aws:acm:us-east-1:829824778702:certificate/ff0b9a25-4c59-433a-a45d-ad88808886bd"
      + regional_domain_name     = (known after apply)
      + regional_zone_id         = (known after apply)
      + security_policy          = "TLS_1_2"

      + endpoint_configuration {
          + types = [
              + "REGIONAL",
            ]
        }
    }

  # cloudflare_record.api-custom-domain-auth-service will be created
  + resource "cloudflare_record" "api-custom-domain-auth-service" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "anton-test"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = 300
      + type        = "CNAME"
      + value       = (known after apply)
      + zone_id     = "8396790b46b91971a00806d5c381d5d0"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_api_gateway_domain_name.api-gw-domain-name: Creating...
aws_api_gateway_domain_name.api-gw-domain-name: Creation complete after 3s [id=anton-test.katapult.com]
cloudflare_record.api-custom-domain-auth-service: Creating...

Error: either 'value' (present: false) or 'data' (present: false) must be provided

  on custom_domain.tf line 11, in resource "cloudflare_record" "api-custom-domain-auth-service":
  11: resource "cloudflare_record" "api-custom-domain-auth-service" {


Releasing state lock. This may take a few moments...
```
please find attached debug.log
[debug.log](https://github.com/cloudflare/terraform-provider-cloudflare/files/5787602/debug.log)
